[{"title":"Fall 2021","date":"Monday, September 27th 2021","description":"This meeting introduced ACM at UCLA’s mission of inclusivity, accessibility, and community building through eight specialized committees covering AI, Cybersecurity, Design, Teaching, and more. Each committee presented their goals, past events, and opportunities for students to get involved, regardless of experience level.","slides":"https://docs.google.com/presentation/d/1oBwDsSow-ekrCgAmoYUFD3oGVjnZ2glt3qnpB1Yy-y0/edit?usp=sharing","notes":"https://www.youtube.com/watch?v=YsNs9OXXDKg","banner":"https://www.uclaacm.com/images/fall_GM_2021_graphic.png","alt_text":"Fall 2021 General Meeting Banner."},{"title":"Winter 2022","date":"Thursday, January 6th 2022","description":"The Winter 2022 GM emphasized ACM’s open-source initiatives, its committee projects, and upcoming events like QWER Hacks and Moonshots focused on tech and society. The presentation also covered winter plans for workshops, competitions, and increased support for equity, diversity, and inclusion.","slides":"https://docs.google.com/presentation/d/1XGyJdmuR78C9liEPlwqMq2PpNSaXS-PtlK15fvzQLRE/edit?usp=sharing","notes":"https://youtu.be/XVdCnEGoKKo","banner":"https://www.uclaacm.com/images/Winter_GM_2022_graphic.png","alt_text":"Winter 2022 General Meeting Banner."},{"title":"Fall 2022","date":"Monday, September 26th 2022","description":"ACM’s Fall 2022 GM focused on welcoming new members with an overview of each committee’s mission—from teaching and cybersecurity to design and AI—alongside events like Hackschool and the internship program. The slides reinforced ACM's commitment to accessibility, learning, and community through a range of inclusive and beginner-friendly initiatives.","slides":"https://docs.google.com/presentation/d/1N_J_FSFWX7PGVCE8qwiRUvLJud4LYEA3SeS3pdaw5aE/edit?usp=sharing","notes":"","banner":"https://www.uclaacm.com/images/fall_GM_2022_graphic.png","alt_text":"Fall 2022 General Meeting Banner."},{"title":"Winter 2023","date":"Monday, January 9th 2023","description":"This meeting introduced new workshops (like Stackschool and advanced AI sessions), highlighted upcoming events such as mentorship programs and hackathons, and celebrated ACM’s commitment to equity, tech ethics, and outreach. It showcased each committee’s winter quarter goals, including AI education, CTF competitions, and impactful tech policy work.","slides":"https://docs.google.com/presentation/d/1CQL-rhZ5dTKstzwSW6kDtngypM0nkxKwHCDrtJgVMRg/edit?usp=sharing","notes":"","banner":"https://www.uclaacm.com/images/Winter_GM_2023_graphic.png","alt_text":"Winter 2023 General Meeting Banner."},{"title":"Fall 2023","date":"Monday, October 2nd 2023","description":"ACM at UCLA introduced its eight+ committees and Board, emphasizing inclusivity, accessibility, and beginner-friendliness across all its initiatives from AI to Cybersecurity to Game Dev. The presentation highlighted major events, mentorship programs, and workshops, while encouraging new members to explore ACM’s vibrant tech community.","slides":"https://docs.google.com/presentation/d/1Wc3wb5jIEo1FITf7CNAPqGTKY1swWOdG2EWsi6C5vXM/edit?usp=sharing","notes":"","banner":"https://www.uclaacm.com/images/fall_GM_2023_graphic.png","alt_text":"Fall 2023 General Meeting Banner."},{"title":"Winter 2024","date":"Monday, January 8th 2024","description":"The Winter 2024 GM focused on upcoming events, career fairs, and committee activities like Dev Team’s AWS full-stack series, Cyber Lab projects, and AI's workshop tracks and research groups. The meeting reiterated ACM’s mission of inclusivity and provided info on how to join committees, the internship program, and flagship events like Hack on the Hill.","slides":"https://docs.google.com/presentation/d/1fvtvkUuXqvYthfU0DZ0j3XDMzSkVoF_q9onnlWDwVZo/edit#slide=id.p","notes":"","banner":"https://www.uclaacm.com/images/Winter_GM_2024_graphic.png","alt_text":"Winter 2024 General Meeting Banner."},{"title":"Fall 2024","date":"Tuesday, October 1st 2024","description":"This GM celebrated ACM’s mission to foster learning, exploration, and community while spotlighting its nine+ committees, each offering hands-on opportunities like building games, teaching kids CS, exploring AI, and tackling ethical tech issues. New and returning members were encouraged to join workshops, apply for internships, and engage with open-source projects throughout the year.","slides":"https://docs.google.com/presentation/d/1uU0UfUApC0Zix0Wyacmg96q4r2WY0Ng_D2p03TO0MBY/edit?usp=sharing","notes":"","banner":"https://www.uclaacm.com/images/fall_GM_2024_graphic.png","alt_text":"Fall 2024 General Meeting Banner."}]